[
  {
    "id": 1,
    "title": "نظم ملفات البيانات",
    "description": "حافظ على توزيع البيانات في مجلدات منفصلة لكل قسم لتسهيل إعادة استخدامها وصيانتها."
  },
  {
    "id": 2,
    "title": "استخدم أسماء واضحة",
    "description": "اختر أسماء ملفات ومعرّفات وصفية تعكس المحتوى ليسهل على الفريق معرفتها بسرعة."
  },
  {
    "id": 3,
    "title": "تحقق من صحة JSON",
    "description": "قبل مشاركة أي ملف تأكد من خلوه من الأخطاء باستخدام أدوات التحقق من صيغة JSON."
  },
  {
    "id": 4,
    "title": "التزم بالتنسيق",
    "description": "اتبع إرشادات DATA_GUIDELINES للحفاظ على وحدة الشكل والحقول بين جميع الملفات."
  },
  {
    "id": 5,
    "title": "روابط صور موثوقة",
    "description": "استخدم روابط ثابتة للصور المخزنة في فرع assets لتجنب انقطاع الوسائط."
  },
  {
    "id": 6,
    "title": "أضف وصفاً مفيداً",
    "description": "احرص على أن تكون أوصاف العناصر مختصرة وواضحة وتوضح أهم مزايا العنصر."
  },
  {
    "id": 7,
    "title": "تجنب التكرار",
    "description": "راجع الملفات للتأكد من عدم تكرار المعرّفات أو البيانات قبل إضافة عناصر جديدة."
  },
  {
    "id": 8,
    "title": "اختبر البيانات",
    "description": "قم بتحميل الملفات في تطبيق تجريبي أو Postman للتأكد من إمكانية استهلاكها دون مشاكل."
  },
  {
    "id": 9,
    "title": "وثّق التغييرات",
    "description": "أضف ملاحظات أو تحديثات في ملف README لتسهيل تتبع التعديلات على بقية الفريق."
  },
  {
    "id": 10,
    "title": "حافظ على الواقعية",
    "description": "اختر بيانات وأرقاماً منطقية لتعطي المستخدمين تجربة أقرب للواقع أثناء الاختبار."
  },
  {
    "id": 11,
    "title": "استخدم التعليقات الافتتاحية",
    "description": "ضع شرحاً مختصراً في أعلى الملفات المعقدة يوضح الهدف من البيانات وأي ملاحظات خاصة."
  },
  {
    "id": 12,
    "title": "خطط لتوسعة مستقبلية",
    "description": "اترك مجالاً لإضافة حقول أو كائنات جديدة دون الحاجة لإعادة هيكلة الملف بالكامل."
  },
  {
    "id": 13,
    "title": "اعتمد أرقاماً ثابتة",
    "description": "استخدم أنماطاً رقمية متسلسلة لتسهيل البحث عن العناصر وتتبعها أثناء التطوير."
  },
  {
    "id": 14,
    "title": "دون فرضياتك",
    "description": "إذا افترضت قيماً تقديرية فاذكر ذلك في الوصف لتوضيح السياق لبقية الفريق."
  },
  {
    "id": 15,
    "title": "استخدم روابط اختبار",
    "description": "عند الحاجة إلى روابط خارجية اختر مواقع موثوقة أو صفحات ثابتة لا تتغير كثيراً."
  },
  {
    "id": 16,
    "title": "راجع الترميز",
    "description": "تأكد من حفظ الملفات بترميز UTF-8 لدعم الأحرف العربية بدون مشاكل."
  },
  {
    "id": 17,
    "title": "استخدم أدوات مقارنة",
    "description": "استعن ببرامج diff لمراجعة التغييرات الكبيرة وضمان عدم حذف قيم مهمة."
  },
  {
    "id": 18,
    "title": "اختبر الأداء",
    "description": "قم بتحميل الملفات كبيرة الحجم في الذاكرة للتأكد من قدرة التطبيق على التعامل معها."
  },
  {
    "id": 19,
    "title": "أضف أمثلة استخدام",
    "description": "أرفق في README مقاطع كود توضح كيفية استيراد البيانات وربطها بالواجهة."
  },
  {
    "id": 20,
    "title": "استخدم التحقق الآلي",
    "description": "ادمج أدوات lint أو اختبارات وحدات بسيطة للتأكد من صحة JSON قبل الدمج."
  },
  {
    "id": 21,
    "title": "احفظ نسخاً احتياطية",
    "description": "قبل تعديل ملفات ضخمة أنشئ نسخة احتياطية لتسهيل الرجوع في حال حصول أخطاء."
  },
  {
    "id": 22,
    "title": "كثّف المراجعة",
    "description": "اطلب من زميل مراجعة البيانات الجديدة خصوصاً إذا كانت ستستخدم في العروض أو الدروس."
  },
  {
    "id": 23,
    "title": "استخدم القوالب",
    "description": "قم بإنشاء قالب JSON فارغ لكل قسم لتسريع عملية الإضافة والحفاظ على الاتساق."
  },
  {
    "id": 24,
    "title": "راقب الترخيص",
    "description": "تأكد من توافق البيانات التي تستوردها من مصادر خارجية مع رخصة المشروع."
  },
  {
    "id": 25,
    "title": "حدد المسؤوليات",
    "description": "عين شخصاً مسؤولاً عن كل قسم لضمان توزيع العمل ومنع التعارضات."
  },
  {
    "id": 26,
    "title": "استخدم التسميات المعيارية",
    "description": "التزم بالأنماط camelCase أو snake_case بحسب ما يحدده الدليل لتوحيد قراءة الحقول."
  },
  {
    "id": 27,
    "title": "سجّل الإصدارات",
    "description": "دوّن رقم إصدار للبيانات عند كل تغيير كبير لتسهيل الرجوع إلى النسخ السابقة."
  },
  {
    "id": 28,
    "title": "افصل بين البيئات",
    "description": "أنشئ ملفات منفصلة لبيانات التطوير والاختبار والإنتاج لتجنب الخلط."
  },
  {
    "id": 29,
    "title": "استفد من المراجعات الآلية",
    "description": "استخدم فحوصات CI للتأكد من أن ملفات JSON صالحة قبل دمج طلبات السحب."
  },
  {
    "id": 30,
    "title": "شارك الخبرة",
    "description": "اكتب تدوينات أو شروحاً حول كيفية بناء البيانات ليستفيد المجتمع ويشارك بتحسينات."
  }
]

